## OBJECTIVE:

* 1.Creating series
* 2.Filtering Series
* 3.Airthmetic operation on series
* 4.dictionary into series
* 5.Creating Dataframe
* 6.Indexing Dataframe
* 7.setting\resetting index
* 8.Row slicing & column Filtering
* 9.Boolean Operation
* 10.Cascading conditions
* 11.Filtering using query() method

## Importing pandas

In [1]:
import numpy as np
import pandas as pd

# creating series

In [3]:
se1 = pd.Series([3,4,5,6,7])
se1

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [4]:
type(se1)

pandas.core.series.Series

In [7]:
# to check the index of series
se1.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
#checking the values in series
se1.values

array([3, 4, 5, 6, 7], dtype=int64)

###  creating the series with own index

In [15]:
scores = pd.Series([100,120,140,150,340],index=['s1','s2','s3','s4','s5'])
scores

s1    100
s2    120
s3    140
s4    150
s5    340
dtype: int64

In [16]:
scores.index

Index(['s1', 's2', 's3', 's4', 's5'], dtype='object')

In [17]:
scores.values

array([100, 120, 140, 150, 340], dtype=int64)

In [18]:
scores[3]

150

In [19]:
scores['s4']

150

### Filtering the series

In [20]:
scores>120

s1    False
s2    False
s3     True
s4     True
s5     True
dtype: bool

In [21]:
scores[scores>120]

s3    140
s4    150
s5    340
dtype: int64

### Performing airthmetic operations

In [22]:
(scores*5)/100

s1     5.0
s2     6.0
s3     7.0
s4     7.5
s5    17.0
dtype: float64

In [24]:
np.sin(scores)

s1   -0.506366
s2    0.580611
s3    0.980240
s4   -0.714876
s5    0.650311
dtype: float64

In [25]:
np.cos(scores)

s1    0.862319
s2    0.814181
s3   -0.197814
s4    0.699251
s5    0.759668
dtype: float64

In [28]:
np.max(scores)

340

In [31]:
# updating the values in series
scores['s4']=250

In [32]:
scores

s1    100
s2    120
s3    140
s4    250
s5    340
dtype: int64

In [35]:
# checking the present of specific index in series
print('s6' in scores)
print('s3' in scores)

False
True

## converting dictionary into series

In [36]:
# creating the dictionary
items = {'Tv':3000,'Bike':4000,'Laptop':1500,'Mobile':1000}
items

{'Tv': 3000, 'Bike': 4000, 'Laptop': 1500, 'Mobile': 1000}

In [37]:
# converting dict into series by simply passing into it
items_ser = pd.Series(items)

In [38]:
items_ser

Tv        3000
Bike      4000
Laptop    1500
Mobile    1000
dtype: int64

In [39]:
type(items_ser)

pandas.core.series.Series

In [49]:
#updating the item as none in series
items_ser['Computer'] = None

In [50]:
items_ser

Tv          3000
Bike        4000
Laptop      1500
Mobile      1000
Computer    None
dtype: object

In [53]:
#checking the nullvalues
items_ser.isnull()

Tv          False
Bike        False
Laptop      False
Mobile      False
Computer     True
dtype: bool

In [55]:
#filtering all the null values
items_ser[items_ser.isnull()]

Computer    None
dtype: object

# Creating dataframe

### Creating dataframe using dictionary

In [56]:
## creating a dictionary to pass for crearting dataframe
df_dict = {
       "Student":['Murali','Abi','Surya','Madhan','Dhanush','Sam'],
       "Age" : np.random.randint(20,25,size=6),
       "Score_1" : np.random.randint(50,100,size=6),
       "Score_2" : np.random.randint(60,90,size=6),
       "Score_3" : np.random.randint(40,85,size=6),
    
}

In [57]:
df_dict

{'Student': ['Murali', 'Abi', 'Surya', 'Madhan', 'Dhanush', 'Sam'],
 'Age': array([20, 23, 20, 24, 24, 21]),
 'Score_1': array([52, 69, 56, 75, 95, 86]),
 'Score_2': array([67, 89, 67, 75, 64, 76]),
 'Score_3': array([70, 80, 53, 69, 46, 43])}

In [60]:
#creating the dataframe
df = pd.DataFrame(df_dict)

In [61]:
df

   Student  Age  Score_1  Score_2  Score_3
0   Murali   20       52       67       70
1      Abi   23       69       89       80
2    Surya   20       56       67       53
3   Madhan   24       75       75       69
4  Dhanush   24       95       64       46
5      Sam   21       86       76       43

In [62]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [63]:
df.columns

Index(['Student', 'Age', 'Score_1', 'Score_2', 'Score_3'], dtype='object')

In [64]:
df['Score_1']

0    52
1    69
2    56
3    75
4    95
5    86
Name: Score_1, dtype: int32

In [65]:
df['Student']

0     Murali
1        Abi
2      Surya
3     Madhan
4    Dhanush
5        Sam
Name: Student, dtype: object

In [68]:
type(df)

pandas.core.frame.DataFrame

In [71]:
type(df['Student'])

pandas.core.series.Series

In [72]:
# updating the dataframe
df['Score_4']= 0

In [73]:
df

   Student  Age  Score_1  Score_2  Score_3  Score_4
0   Murali   20       52       67       70        0
1      Abi   23       69       89       80        0
2    Surya   20       56       67       53        0
3   Madhan   24       75       75       69        0
4  Dhanush   24       95       64       46        0
5      Sam   21       86       76       43        0

###  Creating dataframe using array

In [99]:
#creating the array using random function
arr_2d = np.random.randint(20,100,size=40).reshape(10,4)

In [80]:
arr_2d

array([[76, 34, 72, 22],
       [29, 39, 22, 26],
       [87, 49, 43, 94],
       [53, 26, 36, 54],
       [70, 83, 32, 97],
       [68, 35, 23, 50],
       [71, 33, 98, 98],
       [60, 99, 42, 61],
       [26, 41, 55, 55],
       [28, 86, 69, 64]])

In [94]:
pd.DataFrame(arr_2d)

    0   1   2   3
0  76  34  72  22
1  29  39  22  26
2  87  49  43  94
3  53  26  36  54
4  70  83  32  97
5  68  35  23  50
6  71  33  98  98
7  60  99  42  61
8  26  41  55  55
9  28  86  69  64

In [96]:
#creating column heading
df_ar=pd.DataFrame(arr_2d,columns=['sub1','sub2','sub3','sub4'])

In [97]:
df_ar

   sub1  sub2  sub3  sub4
0    76    34    72    22
1    29    39    22    26
2    87    49    43    94
3    53    26    36    54
4    70    83    32    97
5    68    35    23    50
6    71    33    98    98
7    60    99    42    61
8    26    41    55    55
9    28    86    69    64

In [98]:
df_ar['sub2']

0    34
1    39
2    49
3    26
4    83
5    35
6    33
7    99
8    41
9    86
Name: sub2, dtype: int32

### indexing the dataframe

In [115]:
#creating the dataframe using dict
dict_df = pd.DataFrame( {
       "Student":['Murali','Abi','Surya','Madhan','Dhanush','Sam'],
       "Age" : np.random.randint(20,25,size=6),
       "Score_1" : np.random.randint(50,100,size=6),
       "Score_2" : np.random.randint(60,90,size=6),
       "Score_3" : np.random.randint(40,85,size=6),
    
} , index = [ 'A','B','C','D','E','F'] )

In [116]:
dict_df

   Student  Age  Score_1  Score_2  Score_3
A   Murali   23       94       86       56
B      Abi   24       64       87       45
C    Surya   23       83       77       78
D   Madhan   21       56       64       57
E  Dhanush   23       96       81       80
F      Sam   23       75       78       63

In [117]:
#adding the new column as empty
dict_df['Score_4'] = np.NAN

In [118]:
dict_df

   Student  Age  Score_1  Score_2  Score_3  Score_4
A   Murali   23       94       86       56      NaN
B      Abi   24       64       87       45      NaN
C    Surya   23       83       77       78      NaN
D   Madhan   21       56       64       57      NaN
E  Dhanush   23       96       81       80      NaN
F      Sam   23       75       78       63      NaN

In [120]:
# Now updating some values in column 4 by specifying index
dict_df['Score_4'] = pd.Series([56,73,82],index = ['C','E','F'])

In [121]:
dict_df

   Student  Age  Score_1  Score_2  Score_3  Score_4
A   Murali   23       94       86       56      NaN
B      Abi   24       64       87       45      NaN
C    Surya   23       83       77       78     56.0
D   Madhan   21       56       64       57      NaN
E  Dhanush   23       96       81       80     73.0
F      Sam   23       75       78       63     82.0

## Setting and resetting the index

In [122]:
# setting the student column as my index
dict_df = dict_df.set_index('Student')

In [123]:
dict_df

         Age  Score_1  Score_2  Score_3  Score_4
Student
Murali    23       94       86       56      NaN
Abi       24       64       87       45      NaN
Surya     23       83       77       78     56.0
Madhan    21       56       64       57      NaN
Dhanush   23       96       81       80     73.0
Sam       23       75       78       63     82.0

In [124]:
# resetting the changed index to back position
# giving drop as False, coz don't want to drop the column
dict_df = dict_df.reset_index(drop = False)

In [125]:
dict_df

   Student  Age  Score_1  Score_2  Score_3  Score_4
0   Murali   23       94       86       56      NaN
1      Abi   24       64       87       45      NaN
2    Surya   23       83       77       78     56.0
3   Madhan   21       56       64       57      NaN
4  Dhanush   23       96       81       80     73.0
5      Sam   23       75       78       63     82.0

In [132]:
# changing the index
dict_df.index

RangeIndex(start=0, stop=6, step=1)

In [136]:
dict_df.index = ['a','b','c','d','e','f']

In [137]:
dict_df

   Student  Age  Score_1  Score_2  Score_3  Score_4
a   Murali   23       94       86       56      NaN
b      Abi   24       64       87       45      NaN
c    Surya   23       83       77       78     56.0
d   Madhan   21       56       64       57      NaN
e  Dhanush   23       96       81       80     73.0
f      Sam   23       75       78       63     82.0

In [138]:
#can observe that the index aren't mutable 
dict_df.index['c'] = ['C']

TypeError: Index does not support mutable operations

## row slicing & Columns filtering

In [25]:
#creating the dataframe using dict
dt_df = pd.DataFrame( {
       "Student":['Murali','Abi','Surya','Madhan','Dhanush','Sam'],
       "Age" : np.random.randint(20,25,size=6),
       "Score_1" : np.random.randint(50,100,size=6),
       "Score_2" : np.random.randint(60,90,size=6),
       "Score_3" : np.random.randint(40,85,size=6),
    
} )

In [26]:
dt_df

   Student  Age  Score_1  Score_2  Score_3
0   Murali   23       55       71       60
1      Abi   23       68       85       52
2    Surya   23       71       71       52
3   Madhan   24       99       65       46
4  Dhanush   21       80       83       81
5      Sam   24       57       69       51

In [27]:
#slicing the rows
dt_df[1:4]

  Student  Age  Score_1  Score_2  Score_3
1     Abi   23       68       85       52
2   Surya   23       71       71       52
3  Madhan   24       99       65       46

In [28]:
# column filtering
dt_df[['Student','Score_3']]

   Student  Score_3
0   Murali       60
1      Abi       52
2    Surya       52
3   Madhan       46
4  Dhanush       81
5      Sam       51

## loc [ ]  method

In [35]:
#creating the dataframe using dict
lo_df = pd.DataFrame( {
       "Student":['Murali','Abi','Surya','Madhan','Dhanush','Sam'],
       "Age" : np.random.randint(20,25,size=6),
       "Score_1" : np.random.randint(50,100,size=6),
       "Score_2" : np.random.randint(60,90,size=6),
       "Score_3" : np.random.randint(40,85,size=6),
    
} )

In [36]:
# filtering the rows and columns using loc method
# loc method works only on label based indexing

lo_df

   Student  Age  Score_1  Score_2  Score_3
0   Murali   22       90       62       48
1      Abi   20       77       75       72
2    Surya   21       60       84       46
3   Madhan   23       69       82       60
4  Dhanush   22       56       76       52
5      Sam   24       59       78       44

In [42]:
#can't access the index while the index as integer
lo_df[3]

KeyError: 3

In [37]:
# loc works based on label indexing so converting 1st column as index
lo_df = lo_df.set_index('Student')

In [38]:
lo_df

         Age  Score_1  Score_2  Score_3
Student
Murali    22       90       62       48
Abi       20       77       75       72
Surya     21       60       84       46
Madhan    23       69       82       60
Dhanush   22       56       76       52
Sam       24       59       78       44

In [39]:
#locating using loc for rows
lo_df.loc[['Abi','Dhanush']]

         Age  Score_1  Score_2  Score_3
Student
Abi       20       77       75       72
Dhanush   22       56       76       52

In [41]:
# getting range of rows 
lo_df.loc['Abi':'Sam']

         Age  Score_1  Score_2  Score_3
Student
Abi       20       77       75       72
Surya     21       60       84       46
Madhan    23       69       82       60
Dhanush   22       56       76       52
Sam       24       59       78       44

In [40]:
#locating using loc for both rows and columns
lo_df.loc[['Surya','Sam'],['Age','Score_1','Score_3']]

         Age  Score_1  Score_3
Student
Surya     21       60       46
Sam       24       59       44

## iloc [ ] method

In [43]:
#creating the dataframe using dict
ilo_df = pd.DataFrame( {
       "Student":['Murali','Abi','Surya','Madhan','Dhanush','Sam'],
       "Age" : np.random.randint(20,25,size=6),
       "Score_1" : np.random.randint(50,100,size=6),
       "Score_2" : np.random.randint(60,90,size=6),
       "Score_3" : np.random.randint(40,85,size=6),
    
} )

In [44]:
ilo_df

   Student  Age  Score_1  Score_2  Score_3
0   Murali   23       91       67       73
1      Abi   21       54       89       80
2    Surya   24       98       81       40
3   Madhan   21       81       62       84
4  Dhanush   23       76       63       84
5      Sam   20       85       83       42

In [46]:
#can't access specific row without using iloc
ilo_df[3]

KeyError: 3

In [47]:
#can access specific index
ilo_df.iloc[3]

Student    Madhan
Age            21
Score_1        81
Score_2        62
Score_3        84
Name: 3, dtype: object

In [48]:
ilo_df.iloc[1:5]

   Student  Age  Score_1  Score_2  Score_3
1      Abi   21       54       89       80
2    Surya   24       98       81       40
3   Madhan   21       81       62       84
4  Dhanush   23       76       63       84

In [66]:
ilo_df.iloc[:,1:3]

   Age  Score_1
0   23       91
1   21       54
2   24       98
3   21       81
4   23       76
5   20       85

In [52]:
ilo_df.iloc[2:5,:-1]

   Student  Age  Score_1  Score_2
2    Surya   24       98       81
3   Madhan   21       81       62
4  Dhanush   23       76       63

In [58]:
ilo_df

   Student  Age  Score_1  Score_2  Score_3
0   Murali   23       91       67       73
1      Abi   21       54       89       80
2    Surya   24       98       81       40
3   Madhan   21       81       62       84
4  Dhanush   23       76       63       84
5      Sam   20       85       83       42

In [64]:
#printing alternate rows
ilo_df.iloc[::2]

   Student  Age  Score_1  Score_2  Score_3
0   Murali   23       91       67       73
2    Surya   24       98       81       40
4  Dhanush   23       76       63       84

In [65]:
#printing alternate rows and column
ilo_df.iloc[::3,::2]

  Student  Score_1  Score_3
0  Murali       91       73
3  Madhan       81       84

## Boolean operation

In [67]:
#creating the dataframe using dict
bo_df = pd.DataFrame( {
       "Student":['Murali','Abi','Surya','Madhan','Dhanush','Sam'],
       "Age" : np.random.randint(20,25,size=6),
       "Score_1" : np.random.randint(50,100,size=6),
       "Score_2" : np.random.randint(60,90,size=6),
       "Score_3" : np.random.randint(40,85,size=6),
    
} )

In [68]:
bo_df

   Student  Age  Score_1  Score_2  Score_3
0   Murali   23       64       71       70
1      Abi   22       90       78       63
2    Surya   24       71       80       57
3   Madhan   22       78       81       49
4  Dhanush   22       58       61       44
5      Sam   20       87       67       40

In [75]:
#it dosen't work because the df has both string and integer
bo_df>50

TypeError: '>' not supported between instances of 'str' and 'int'

In [74]:

bo_df[bo_df['Score_3'] > 50]

  Student  Age  Score_1  Score_2  Score_3
0  Murali   23       64       71       70
1     Abi   22       90       78       63
2   Surya   24       71       80       57

In [76]:
# filtering based on condition
bo_df[bo_df['Student']=='Abi']

  Student  Age  Score_1  Score_2  Score_3
1     Abi   22       90       78       63

## cascading condiitons

In [77]:
bo_df

   Student  Age  Score_1  Score_2  Score_3
0   Murali   23       64       71       70
1      Abi   22       90       78       63
2    Surya   24       71       80       57
3   Madhan   22       78       81       49
4  Dhanush   22       58       61       44
5      Sam   20       87       67       40

In [82]:
#and operation
bo_df[(bo_df['Score_1']>80) & (bo_df['Score_2']>70)]

  Student  Age  Score_1  Score_2  Score_3
1     Abi   22       90       78       63

In [91]:
#or operation
bo_df[(bo_df['Score_2']<50) | (bo_df['Score_3']>50)]

  Student  Age  Score_1  Score_2  Score_3
0  Murali   23       64       71       70
1     Abi   22       90       78       63
2   Surya   24       71       80       57

## filtering using query() method for cascading

In [92]:
#can be used simply using query()
bo_df.query('Student =="Dhanush"')

   Student  Age  Score_1  Score_2  Score_3
4  Dhanush   22       58       61       44

In [99]:
#no one scored same marks
bo_df.query('Score_1 == Score_2')

Empty DataFrame
Columns: [Student, Age, Score_1, Score_2, Score_3]
Index: []

In [100]:
# and operation / line82
bo_df.query('Score_1 > 80 & Score_2>70')

  Student  Age  Score_1  Score_2  Score_3
1     Abi   22       90       78       63

In [102]:
#or operation
bo_df.query('Score_2<50 | Score_3>50')

  Student  Age  Score_1  Score_2  Score_3
0  Murali   23       64       71       70
1     Abi   22       90       78       63
2   Surya   24       71       80       57